RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sysanalog.h
/***************************************************************************//**
* \file cy_sysanalog.h
* \version 2.10
*
* Header file for the system level analog reference driver.
*
********************************************************************************
* \copyright
* Copyright 2017-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_sysanalog
* \{
*
* This driver provides an interface for configuring the Analog Reference (AREF),
* Low Power Oscillator (LpOsc), Deep Sleep Clock and Timer blocks
* and querying the INTR_CAUSE register of the Programmable Analog SubSystem (PASS) hardware block.
*
* The functions and other declarations used in this driver are in cy_sysanalog.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* \section group_pass_structure PASS block structure
*
* \image html passv2_diagram.png
* \image latex passv2_diagram.png
*
* The Programmable Analog SubSystem (PASS) hardware block contains a set of analog 
* subblocks such as AREF, CTB, SAR, analog routing switches and others.
* In order to provide a firmware interface to PASS, subblocks are united into groups, 
* which have their own drivers: SysAnalog, \ref group_ctb "CTB" and 
* \ref group_sar "SAR".
* 
* \section group_sysanalog_features SysAnalog Features Description
*
* SysAnalog driver includes the following features:
* - \ref group_sysanalog_aref
* - \ref group_sysanalog_lposc (Available only for PASS_ver2.)
* - \ref group_sysanalog_dpslp (Available only for PASS_ver2.)
* - \ref group_sysanalog_timer (Available only for PASS_ver2.)
*
* The following sections describe how to initialize driver features:
* - \ref group_sysanalog_aref_usage_init
* - \ref group_sysanalog_deepsleepinit
*
* \section group_sysanalog_aref AREF
*
* The AREF block has the following features:
*
*   - Generates a voltage reference (VREF) from one of three sources:
*       - Local 1.2 V reference (<b>low noise, optimized for analog performance</b>)
*       - Reference from the SRSS (high noise, not recommended for analog performance)
*       - An external pin
*   - Generates a 1 uA "zero dependency to absolute temperature" (IZTAT) current reference
*     that is independent of temperature variations. It can come from one of two sources:
*       - Local reference (<b>low noise, optimized for analog performance</b>)
*       - Reference from the SRSS (high noise, not recommended for analog performance)
*   - Generates a "proportional to absolute temperature" (IPTAT) current reference
*   - Option to enable local references in Deep Sleep mode
*
* The locally generated references are the recommended sources for blocks in the PASS because
* they have tighter accuracy, temperature stability, and lower noise than the SRSS references.
* The SRSS references can be used to save power if the low accuracy and higher noise can be tolerated.
*
* \image html aref_block_diagram.png
* \image latex aref_block_diagram.png
*
* The outputs of the AREF are consumed by multiple blocks in the PASS and by the CapSense (CSDv2) block.
* In some cases, these blocks have the option of using the references from the AREF. This selection would be
* in the respective drivers for these blocks. In some cases, these blocks require the references from the
* AREF to function.
*
* <table class="doxtable">
*   <tr><th>AREF Output</th><th>\ref group_sar "SAR"</th><th>\ref group_ctdac "CTDAC"</th><th>\ref group_ctb "CTB"</th><th>CSDv2</th></tr>
*   <tr>
*     <td>VREF</td>
*     <td>optional</td>
*     <td>optional</td>
*     <td>--</td>
*     <td>optional</td>
*   </tr>
*   <tr>
*     <td>IZTAT</td>
*     <td><b>required</b></td>
*     <td>--</td>
*     <td>optional</td>
*     <td>optional</td>
*   </tr>
*   <tr>
*     <td>IPTAT</td>
*     <td>--</td>
*     <td>--</td>
*     <td><b>required</b></td>
*     <td>--</td>
*   </tr>
* </table>
*
* This driver provides a function to query the INTR_CAUSE register of the PASS.
* There are two interrupts in the PASS:
*
*   -# one global interrupt for all CTBs (up to 4)
*   -# one global interrupt for all CTDACs (up to 4)
*
* Because the interrupts are global, the INTR_CAUSE register is needed to query which hardware instance
* triggered the interrupt.
*
* \subsection group_sysanalog_aref_usage_init AREF Configuration
*
* To configure the AREF, call \ref Cy_SysAnalog_Init and provide a pointer
* to the configuration structure, \ref cy_stc_sysanalog_config_t. Three predefined structures
* are provided in this driver to cover a majority of use cases:
*
*   - \ref Cy_SysAnalog_Fast_Local <b>(recommended for analog performance)</b>
*   - \ref Cy_SysAnalog_Fast_SRSS
*   - \ref Cy_SysAnalog_Fast_External
*
* After initialization, call \ref Cy_SysAnalog_Enable to enable the hardware.
*
* ### Deep Sleep Operation
*
* The AREF current and voltage references can be enabled to operate in Deep Sleep mode
* with \ref Cy_SysAnalog_SetDeepSleepMode. There are four options for Deep Sleep operation:
*
*   - \ref CY_SYSANALOG_DEEPSLEEP_DISABLE : Disable AREF IP block
*   - \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_1 : Enable IPTAT generator for fast wakeup from Deep Sleep mode. IPTAT outputs for CTBs are disabled.
*   - \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_2 : Enable IPTAT generator and IPTAT outputs for CTB
*   - \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_IZTAT_VREF : Enable all generators and outputs: IPTAT, IZTAT, and VREF
*
* Recall that the CTB requires the IPTAT reference. For the CTB to operate at the 1 uA current mode in Deep Sleep mode,
* the AREF must be enabled for \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_IZTAT_VREF. For the CTB to operate at the 100 nA
* current mode in Deep Sleep mode, the AREF must be enabled for \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_2 minimum. In this
* lower current mode, the AREF IPTAT must be redirected to the CTB IZTAT. See the high level function \ref
* Cy_CTB_SetCurrentMode in the CTB PDL driver.
*
* If the CTDAC is configured to use the VREF in Deep Sleep mode, the AREF must be enabled for \ref CY_SYSANALOG_DEEPSLEEP_IPTAT_IZTAT_VREF.
*
* \note
* The SRSS references are not available to the AREF in Deep Sleep mode. When operating
* in Deep Sleep mode, the local or external references must be selected.
*
* \section group_sysanalog_lposc Low Power Oscillator
* Features:
*   - Internal PASS_ver2 8MHz oscillator which does not require any external components.
*   - Can work in Deep Sleep power mode.
*   - Can be used as a clock source for the Deep Sleep Clock.
*
* Low Power Oscillator clocking mode is configured by 
* cy_stc_sysanalog_deep_sleep_config_t::lpOscDsMode configuration structure item, which 
* should be passed as a parameter to \ref Cy_SysAnalog_DeepSleepInit function.
* See \ref group_sysanalog_functions_lposc for other Low Power Oscillator control functions.
*
* \section group_sysanalog_dpslp Deep Sleep Clock
* Features:
*   - Internal PASS_ver2 deep sleep capable clock selector/divider
*   - Can be used as clock source for CTB pump, SAR ADC and Timer
*
* Deep Sleep clock is configurable by cy_stc_sysanalog_deep_sleep_config_t::dsClkSource and
* cy_stc_sysanalog_deep_sleep_config_t::dsClkdivider configuration structure items,
* which should be passed as a parameter to \ref Cy_SysAnalog_DeepSleepInit function.
*
* \section group_sysanalog_timer Timer
* Features:
*   - Internal PASS_ver2 16-bit down counting timer
*   - Can be used to trigger one or few SAR ADCs
*   - Can be clocked from 
*       - Peripheral Clock (CLK_PERI),
*       - Low Frequency Clock (CLK_LF) 
*       - Deep Sleep Clock
*   - If clocked from Deep Sleep Clock, timer can be used to trigger SAR ADC scans
*     in Deep Sleep power mode.
*
* Timer is configurable by cy_stc_sysanalog_deep_sleep_config_t::timerClock
* and cy_stc_sysanalog_deep_sleep_config_t::timerPeriod configuration structure items,
* which should be passed as a parameter to \ref Cy_SysAnalog_DeepSleepInit function.
* Also see \ref group_sysanalog_functions_timer for other Timer configuration and control functions.
* 
* \section group_sysanalog_deepsleepinit Low Power Oscillator, Deep Sleep Clock and Timer Configuration
* To configure Low Power Oscillator, Deep Sleep Clock and Timer blocks, 
* call \ref Cy_SysAnalog_DeepSleepInit function and provide pointer to PASS block and pointer 
* to the \ref cy_stc_sysanalog_deep_sleep_config_t configuration structure. In order to start
* Low Power Oscillator and Timer, call corresponding enable functions:
*
* \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_INIT_DS
*
* \section group_sysanalog_more_information More Information
*
* For more information on the AREF, Deep Sleep Clock and Timer, refer to the technical reference manual (TRM).
*
* \section group_sysanalog_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>2.10</td>
*     <td>The CY_SYSANALOG_STARTUP_NORMAL and Cy_SysAnalog_SetArefMode are deprecated.
*         The HW is anyways initialized with the CY_SYSANALOG_STARTUP_FAST.</td>
*     <td>User experience enhancement.</td>
*   </tr>
*   <tr>
*     <td>2.0</td>
*     <td>Added new features: LPOSC, DSCLK, TIMER.</td>
*     <td>New silicon family support.</td>
*   </tr>
*   <tr>
*     <td>1.10.1</td>
*     <td>Minor documentation updates.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.10</td>
*     <td>Flattened the organization of the driver source code into the single
*         source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using dereferenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sysanalog_macros Macros
* \defgroup group_sysanalog_functions Functions
* \{
*   \defgroup group_sysanalog_functions_lposc   Low Power Oscillator Functions
*   \defgroup group_sysanalog_functions_timer   Timer Functions
* \}
* \defgroup group_sysanalog_globals Global Variables
* \defgroup group_sysanalog_data_structures Data Structures
* \defgroup group_sysanalog_enums Enumerated Types
*/

#if !defined(CY_SYSANALOG_H)
#define CY_SYSANALOG_H

