RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sysanalog.h
/*******************************************************************************
* Function Name: Cy_SysAnalog_IztatSelect
****************************************************************************//**
*
* Set the source for the 1 uA IZTAT. The IZTAT can come from:
*   - the locally generated IZTAT
*   - the SRSS (not available to the AREF in Deep Sleep mode)
*
* The locally generated reference has higher accuracy, more stability over temperature,
* and lower noise than the SRSS reference.
*
* \param iztat
* Value from enum \ref cy_en_sysanalog_iztat_source_t
*
* \return None
*
* \funcusage
*
* \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_IZTAT_SELECT
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_IztatSelect(cy_en_sysanalog_iztat_source_t iztat)
{
    CY_ASSERT_L3(CY_SYSANALOG_IZTAT(iztat));

    PASS_AREF_AREF_CTRL = (PASS_AREF_AREF_CTRL & ~PASS_AREF_AREF_CTRL_IZTAT_SEL_Msk) | (uint32_t) iztat;
}

/**
* \addtogroup group_sysanalog_functions_lposc
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysAnalog_LpOscEnable
****************************************************************************//**
*
* Enables Low Power Oscillator in configured by \ref Cy_SysAnalog_DeepSleepInit 
* mode.
*
* \param base Pointer to the PASS register structure.
*
* \return None
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_LPOSC_ENABLE
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_LpOscEnable(PASS_Type * base)
{
    if(!CY_PASS_V1)
    {
        PASS_LPOSC_CTRL(base) = PASS_LPOSC_V2_CTRL_ENABLED_Msk;
    }
    else
    {
        /* Low Power Oscillator feature is not supported on PASS_ver1 IP block. */
        CY_ASSERT_L1(false);
    }
}


/*******************************************************************************
* Function Name: Cy_SysAnalog_LpOscDisable
****************************************************************************//**
*
* Disables the Low Power Oscillator.
*
* \param base Pointer to the PASS register structure.
*
* \return None
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_LPOSC_DISABLE
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_LpOscDisable(PASS_Type * base)
{
    if(!CY_PASS_V1)
    {
        PASS_LPOSC_CTRL(base) = 0UL;
    }
}

/** \} */

/**
* \addtogroup group_sysanalog_functions_timer
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysAnalog_TimerEnable
****************************************************************************//**
*
* Enable the analog subsystem timer in configured by 
* \ref Cy_SysAnalog_DeepSleepInit mode.
*
* \param base Pointer to the PASS register structure.
*
* \return None
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_TimerEnable(PASS_Type * base)
{
    if (!CY_PASS_V1)
    {
        PASS_TIMER_CTRL(base) = PASS_TIMER_V2_CTRL_ENABLED_Msk;
    }
}


/*******************************************************************************
* Function Name: Cy_SysAnalog_TimerDisable
****************************************************************************//**
*
* Disable the analog subsystem timer.
*
* \param base Pointer to the PASS register structure.
*
* \return None
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_TimerDisable(PASS_Type * base)
{
    if (!CY_PASS_V1)
    {
        PASS_TIMER_CTRL(base) = 0UL;
    }
}

/*******************************************************************************
* Function Name: Cy_SysAnalog_TimerSetPeriod
****************************************************************************//**
*
* Sets the analog subsystem timer period.
*
* \param base Pointer to the PASS register structure.
*
* \param periodVal the period value. Actual timer period equals periodVal + 1.
*
* \return None
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_TIMER_PERIOD
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysAnalog_TimerSetPeriod(PASS_Type * base, uint32_t periodVal)
{
    if (!CY_PASS_V1)
    {
        PASS_TIMER_PERIOD(base) = _VAL2FLD(PASS_TIMER_V2_PERIOD_PER_VAL, periodVal);
    }
    else
    {
        /* Timer feature is not supported on PASS_ver1 IP block. */
        CY_ASSERT_L1(false);
    }
}

/*******************************************************************************
* Function Name: Cy_SysAnalog_TimerGetPeriod
****************************************************************************//**
*
* Returns the analog subsystem timer period.
*
* \param base Pointer to the PASS register structure.
*
* \return the Timer period value.
*
* \funcusage \snippet sysanalog/snippet/main.c SYSANA_SNIPPET_TIMER_PERIOD
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysAnalog_TimerGetPeriod(const PASS_Type * base)
{
    uint32_t period = 0UL;
    if (!CY_PASS_V1)
    {
        period = _FLD2VAL(PASS_TIMER_V2_PERIOD_PER_VAL, PASS_TIMER_PERIOD(base));
    }

    return period;
}

/** \} */

/** \} group_sysanalog_functions */
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40PASS */

#endif /** !defined(CY_SYSANALOG_H) */

/** \} group_sysanalog */

/* [] END OF FILE */
